app/Http/Controllers/UserController.php

    public function create() {

        return view('users.create', [
            'roles' => Role::get(),
        ]);
---
select * from `users` where `role_id` > 1 and `users`.`deleted_at` is null
select * from `roles`

    public function store(Request $request, User $user) {

        if (Auth::user()->role_id == Role::TRAINER) {
            $ids = '4';
        } elseif (Auth::user()->role_id == Role::SUB_ADMIN) {
            $ids = '3,4';
        } else {
            $ids = '2,3,4';
        }

        $roles = Role::where('slug', '!=', 'admin')->pluck('id')->toArray();

        if (!in_array($request->role_id, $roles)) {
            return redirect()->route('users.index')
                ->with('error', __('Role does not exists'));
        }

        $user = User::where('email', $request->email)->withTrashed()->first();
        if ($user) {
            if (!$user->deleted_at) {
                return back()->with('error', __('Email already exists'));
            } else {
                $user->restore();
                $user->update([
                    'first_name' => $request->first_name,
                    'last_name' => $request->last_name,
                    'role_id' => $request->role_id,
                ]);
                return back()->with('success', __('User updated successfully.'));
---
select `id` from `roles` where `slug` != 'admin'
select * from `roles`


        $attributes += ['created_by' => Auth::id()];

        $user = User::create($attributes);
---
insert into `users` (`first_name`, `last_name`, `email`, `password`, `role_id`, `created_by`, `updated_at`, `created_at`) values ('Trainer2', 'user', 'emp12@yopmail.com', '$2y$10$MptFbwhaiTaxuWy8Cpp2pOy9f9vqsejnC1FcdKK2Ovl4y.3LSaQ4S', '2', 1, '2022-06-17 05:38:52', '2022-06-17 05:38:52')

    public function edit(User $user) {

        return view('users.edit', [
            'roles' => Role::get(),
            'user' => $user,
        ]);
---
select * from `roles`

    public function update(User $user, Request $request) {

        $attributes = request()->validate([
            'first_name' => ['required', 'max:255', 'min:3', 'string'],
            'last_name' => ['required'],
            'email' => ['required', 'email', 'max:255'],
            'password' => ['required', Password::defaults()],
        ]);

        $attributes += [
            'role_id' => $request->role_id,
        ];

        $user->update($attributes);
---
update `users` set `role_id` = '4', `first_name` = 'Employee1', `last_name` = 'user', `password` = '$2y$10$S9Kt0HqRAN24uAqWAu4dv.aPA660yqXCXgoVD9O20MwLC6UjVXrLa', `users`.`updated_at` = '2022-06-16 09:14:38' where `id` = 8