app/Http/Controllers/UserStatusController.php

    public function update(User $user) {
        if ($user->status == User::INACTIVE){
            $attribute['status'] = User::ACTIVE;
        }
        else {
            $attribute['status'] = User::INACTIVE;
        }

        $user->update($attribute);
---
update `users` set `status` = 1, `users`.`updated_at` = '2022-06-16 11:17:10' where `id` = 2